# 정규표현식 

# instll.packages("stringr")
# library(stringr)

install.packages("stringr")

library(stringr)

s1 <-  "abcd1234ABCDEFG홍길동tel010-1234-5678,031-1234-5678 010-123-5678 02-234-1234 # 주민번호123456-1234567 123456-2234567 123456-3234567 123456-4234567"

s1
#영문 소문자가 3자 연속하는 경우 추츨 하기

str_extract_all(s1, "[a-z]{3}") #"abc" "end"

#영문 소문자가 3자 이상 연속하는 경우 축출
str_extract_all(s1, "[a-z]{3,}") #abcd" "tel"  "end" 

#영문 소문자가 1자이상 3자 이하 연속하는 경우 축출 
str_extract_all(s1, "[a-z]{1,3}")

#extract_all, extract 의 차이점 
str_extract(s1, "[a-z]{1,3}") #"abc"

#특정값 호출 
str_extract_all(s1, "tel") #"tel"
str_extract_all(s1, "홍길동") #"홍길동"

#모든 한글을 축출하라 
str_extract(s1, "[가-힣]") # "홍" 
str_extract_all(s1, "[가-힣]") # "홍" "길" "동"
str_extract_all(s1, "[가-힣]{3}") #"홍길동"

# 특정 문자열을 제외 : ex) 한글제외 
str_extract_all(s1, "[^가-힣]")

########################################

#지정된 길이(예: 3자리) 의 단어를 추출 
str_extract_all(s1, "\\w{3}" ) # "abc"    "d12"    "34A"    "BCD"    "EFG"    "홍길동" "tel"    "010"    "112"    "567"    "end" 

#숫자 추출 
s1
str_extract_all(s1, "[0-9]-")
s1
##### 전화번호 추출 ############
#지역번호 3자리, 국번: 4자리, 번호4자리만 축출 
str_extract_all(s1, "[.0-9]{3}-[.0-9]{4}-[.0-9]{3,4}") #"010-1234-5678"

#지역번호 3자리, 국번: 3자리, 번호4자리만 축출 
str_extract_all(s1, "[0-9]{3}-[0-9]{3}-[0-9]{4}")

#지역번호 2자리서울번호(02), 국번: 3자리, 번호4자리만 축출 
str_extract_all(s1, "[^0-9]{1}[0-9]{2}-[0-9]{3}-[0-9]{4}")

#지역번호 2자리, 국번: 4자리, 번호4자리만 축출
str_extract_all(s1, "[0-9]{3}-[0-9]{4}-[0-9]{3,4}")

######### 주민번호 축축 ###########
# 기본 축축 (6자리-7자리 )

s1
str_extract_all(s1, "[0-9]{6}-[0-9]{7}") 

#뒷자리 첫번째 숫자가 1부터 4인 경우 

# 1인경우 
str_extract_all(s1, "[0-9]{6}-[1]{1}[0-9]{6}") 

# 2인경우 
str_extract_all(s1, "[0-9]{6}-[2]{1}[0-9]{6}") 

# 3인경우 
str_extract_all(s1, "[0-9]{6}-[3]{1}[0-9]{6}") 

# 4인경우 
str_extract_all(s1, "[0-9]{6}-[4]{1}[0-9]{6}") 


